export const SPINNER_LABELS = [
  "Космос",
  "Технологии",
  "Медицина",
  "Экология",
  "Искусство",
  "Спорт",
];

export const YEARS_LABELS = [
  {
    year1: 1965,
    year2: 1975,
  },
  {
    year1: 1990,
    year2: 2000,
  },
  {
    year1: 2023,
    year2: 2024,
  },
  {
    year1: 2025,
    year2: 2026,
  },
  {
    year1: 2030,
    year2: 2040,
  },
  {
    year1: 2000,
    year2: 2100,
  },
];

export const eventsData = [
  // Космос (1965-1975)
  [
    {
      year: "1965",
      description: "Первый выход человека в открытый космос (Алексей Леонов)",
    },
    {
      year: "1969",
      description: "Первая высадка человека на Луну (миссия Аполлон-11)",
    },
    {
      year: "1971",
      description: "Запуск первой в мире орбитальной станции Салют-1",
    },
    {
      year: "1973",
      description: "Запуск космического аппарата Пионер-10 к Юпитеру",
    },
    {
      year: "1975",
      description:
        "Совместная миссия Союз-Аполлон - первая международная стыковка в космосе",
    },
    {
      year: "1965",
      description: "Первый выход человека в открытый космос (Алексей Леонов)",
    },
    {
      year: "1969",
      description: "Первая высадка человека на Луну (миссия Аполлон-11)",
    },
    {
      year: "1971",
      description: "Запуск первой в мире орбитальной станции Салют-1",
    },
    {
      year: "1973",
      description: "Запуск космического аппарата Пионер-10 к Юпитеру",
    },
    {
      year: "1975",
      description:
        "Совместная миссия Союз-Аполлон - первая международная стыковка в космосе",
    },
  ],

  // Технологии (1990-2000)
  [
    {
      year: "1991",
      description: "Тим Бернерс-Ли представляет World Wide Web (WWW)",
    },
    {
      year: "1994",
      description: "Появление первого смартфона IBM Simon",
    },
    {
      year: "1997",
      description: "Компьютер Deep Blue обыгрывает Гарри Каспарова в шахматы",
    },
    {
      year: "1998",
      description: "Основание компании Google",
    },
    {
      year: "1999",
      description: "Появление технологии Wi-Fi для массового использования",
    },
  ],

  // Медицина (2023-2024)
  [
    {
      year: "2023",
      description:
        "Первые клинические испытания ИИ-систем для диагностики рака с точностью 98%",
    },
    {
      year: "2023",
      description:
        "Разработка бионического глаза, возвращающего зрение незрячим пациентам",
    },
    {
      year: "2024",
      description:
        "Утверждение первого препарата для замедления болезни Альцгеймера",
    },
    {
      year: "2024",
      description:
        "Первая успешная трансплантация искусственно выращенной печени",
    },
    {
      year: "2024",
      description:
        "Разработка нанороботов для точечной доставки лекарств в организме",
    },
  ],

  // Экология (2025-2026)
  [
    {
      year: "2025",
      description:
        "Запуск глобальной системы мониторинга выбросов CO2 в реальном времени",
    },
    {
      year: "2025",
      description:
        "Массовый переход европейских стран на зелёную энергетику (75% от общего потребления)",
    },
    {
      year: "2026",
      description:
        "Изобретение биоразлагаемого аналога пластика с нулевым экоследом",
    },
    {
      year: "2026",
      description:
        "Запуск международного проекта по очистке океана от микропластика",
    },
    {
      year: "2026",
      description:
        "Разработка технологии улавливания углерода с эффективностью 90%",
    },
  ],

  // Искусство (2030-2040)
  [
    {
      year: "2031",
      description:
        "Первая выставка картин, полностью созданных квантовыми компьютерами",
    },
    {
      year: "2033",
      description:
        "Открытие виртуального музея с тактильными голограммами шедевров искусства",
    },
    {
      year: "2035",
      description:
        "Революция в киноиндустрии - фильмы с изменяемым сюжетом по желанию зрителя",
    },
    {
      year: "2037",
      description:
        "Возрождение забытых музыкальных инструментов с помощью 3D-печати",
    },
    {
      year: "2039",
      description:
        "Первая Нобелевская премия по литературе за произведение, созданное ИИ",
    },
  ],

  // Спорт (2000-2100)
  [
    {
      year: "2004",
      description:
        "Введение антидопингового кодекса Всемирного антидопингового агентства (WADA)",
    },
    {
      year: "2012",
      description: "Лондон становится первым городом, принявшим три Олимпиады",
    },
    {
      year: "2022",
      description:
        "Первые зимние Олимпийские игры с искусственным снегом на 95% объектов",
    },
    {
      year: "2048",
      description: "Включение киберспорта в программу Олимпийских игр",
    },
    {
      year: "2089",
      description:
        "Установление мирового рекорда по марафону - 1 час 58 минут (с бионическими протезами)",
    },
  ],
];
